2/p/TEST/src/DataProcessors/ПодготовкаКЗагрузкеТестовЧерезСайт/ПодготовкаКЗагрузкеТестовЧерезСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодготовкаКЗагрузкеТестовЧерезСайт</name>
  <comment>В этой обраотке будет выполнятся код, который необходим для выполнения загрузки вопросов</comment>
</mdclass:DataProcessor>

2/p/TEST/src/Catalogs/ТС_Тесты/ТС_Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТС_Тесты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТС_Курсы</owners>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Устаревший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.ТС_Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьОтветы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательФайла</name>
    <type>
      <types>CatalogRef.ТС_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВопроса</name>
    <comment>Для загрузки данных</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРаздела</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DL_RES_Free</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DL_RES_Dist</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удПодтверждение</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаПодтверждение</name>
      <type>
        <types>DocumentRef.ТС_РезультатТестирования</types>
        <types>CatalogRef.ТС_Файлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КартинкиВКомментариях</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ТС_Файлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2/p/TEST/src/DataProcessors/ПодготовкаКЗагрузкеТестовЧерезСайт/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьНумерациюРазделов(Команда)
	ВыполнитьНумерациюРазделовНаСервере();
	СообщитьПользователю("Обработка завершена");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьНумерациюРазделовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_Тесты.Ссылка КАК Ссылка,
		|	ТС_Тесты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ТС_Тесты КАК ТС_Тесты
		|ГДЕ
		|	ТС_Тесты.ЭтоГруппа
		|	И НЕ ТС_Тесты.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		
		КоличествоСимволовВНомереРаздела = СтрНайти(Выборка.Наименование, ".") -1;
		
		Если КоличествоСимволовВНомереРаздела = 0 Тогда
			СообщитьПользователю("Не удалось заполнить номер раздела для раздела" + Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		НомерРазделаСтрокой = Лев(Выборка.Наименование, КоличествоСимволовВНомереРаздела);
		
		Попытка
			НомерРаздела = Число(НомерРазделаСтрокой);
		Исключение
			
			СообщитьПользователю("Не удалось заполнить номер раздела для раздела" + Выборка.Ссылка);
			Продолжить;
			
		КонецПопытки;
		
		ОбъектТест = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектТест.НомерРаздела= НомерРаздела;
		ОбъектТест.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНумерациюВопросов(Команда)
	ВыполнитьНумерациюНомеровНаСервере();
	СообщитьПользователю("Обработка завершена");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьНумерациюНомеровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_Тесты.Ссылка КАК Ссылка,
		|	ТС_Тесты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ТС_Тесты КАК ТС_Тесты
		|ГДЕ
		|	ТС_Тесты.НомерВопроса = """"
		|	И НЕ ТС_Тесты.ПометкаУдаления
		|	И НЕ ТС_Тесты.Устаревший";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КоличествоСимволовВНомереВопроса = СтрНайти(Выборка.Наименование, "_", НаправлениеПоиска.СКонца); 
		Если КоличествоСимволовВНомереВопроса = 0 Тогда 
			СообщитьПользователю("Не удалось заполнить номер вопроса для вопроса " + Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		НомерВопросаСтрокой = Прав(Выборка.Наименование, КоличествоСимволовВНомереВопроса);
		ОбъектТест = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектТест.НомерВопроса= НомерВопросаСтрокой;
		ОбъектТест.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьПользователю(ТексСообщения = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТексСообщения;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыЗагрузкиТестовИзСайтаНаКлиенте(Команда)
	ОткрытьФорму("Обработка.ЗаполнитьДанныеВРегистрПараметрыФормированияЗапросаДляОбновленияТестовИзФайла.Форма");
КонецПроцедуры
